package scsai.cmb.helper;

import java.util.HashMap;
import java.util.Map;
import java.util.Random;

public class AddressGenerate {

	private static String[] firstLevel = { "北京市", "天津市", "上海市", "重庆市", "新疆", "西藏", "内蒙古", "广西", "黑龙江省", "吉林省", "辽宁省",
			"河北省", "山东省", "江苏省", "安徽省", "浙江省", "福建省", "广东省", "海南省", "云南省", "贵州", "四川", "湖南省", "湖北省", "山西省", "陕西省", "甘肃",
			"青海省", "江西省", "台湾" };

	private static Map<String, String> secondLevel = new HashMap<String, String>();
	private static String[] thridLevel="积玉桥街道,杨园街道,徐家棚街道,粮道街街道,中华路街道,黄鹤楼街道,紫阳街道,白沙洲街道,首义路街道,中南路街道,,水果湖街道,珞珈山街道,石洞街道,南湖街道,红卫路街道,冶金街道,新沟桥街道,红钢城街道,工人村街道,青山镇街道,厂前街道,武东街道,白玉山街道,钢花村街道,珞南街道,关山街道,狮子山街道,张家湾街道,红旗街道,葛化街道,洪山街道,和平街道,花山镇,左岭镇,青菱乡,九峰乡,,建设乡,天兴乡,吴家山街道,走马岭街道,新沟街道,长青街道,慈惠街道,径河街道,金银湖街道,将军路街道,东山办事处,柏泉办事处,辛安渡办事处,纱帽街道,东荆街道,湘口街道,邓南街道,蔡甸街道,奓山街道,永安街道,侏儒街道,大集街道,张湾街道,沌口街道,军山街道,索河镇,玉贤镇,消泗乡,纸坊街道,金口街道,乌龙泉街道,郑店街道,流芳街道,五里界街道,法泗镇,安山镇,湖泗镇,豹澥镇,山坡乡,舒安乡,前川街道,祁家湾街道,横店街道,罗汉寺街道,滠口街道,六指街道,天河街道,武湖街道,姚家集镇,蔡家榨镇,王家河镇,西塔街道,南湖街道,马路湾街道,新华街道,集贤街道,八经街道,长白街道,北市场街道,太原街街道,南市场街道,浑河湾街道,沈水湾街道,小北街道,大北街道,万泉街道,洮昌街道,文官街道,二台子街道,津桥街道,东站街道,辽沈街道,珠林街道,长安街道,新东街道,东塔街道,三台子街道,辽河街道,黄河街道,三洞桥街道,华山街道,寿泉街道,塔湾街道,明廉街道,新乐街道,舍利塔街道,卫工街道,工人村街道,轻重工街道,七路街道,启工街道,艳粉路官街道,兴齐保工街道,齐贤兴顺街道,笃工街道,兴华街道,云峰贵和街道,兴工街道,霁虹街道,凌空街道,解放街道,民主街道,临湖街道,中兴街道,湖西街道,八一镇,红菱堡镇,林盛堡镇,沙河铺镇,十里河镇,陈相屯镇,姚千户屯镇,王纲堡乡,永乐乡,大沟乡,白清寨乡,佟沟乡,南塔街道,泉园街道,丰乐街道,马官桥街道,东陵街道,英达街道,前进街道,东湖街道,浑河站东街道,五三街道,浑河站西街道,满堂街道,深井子街道,白塔街道,桃仙街道,祝家街道,李相街道,高坎街道,王滨沟乡,新城子街道,清水台街道,辉山街道,道义街道,虎石台街,道财落街道,望滨街道,兴隆台镇,清水台镇,新城子乡,黄家锡伯族乡,石佛寺朝鲜族锡伯族乡,尹家乡,马刚乡,迎宾路街道,北塔街道,陵西街道,城东湖路街道,于洪街道,南阳湖街道,北陵街道,陵东街道,沙岭街道,平罗街道,马三家街道,大潘街道,造化街道,翟家街道,大兴街道,大青中朝友谊街道,西三环街道,彰驿站镇,高花镇,光辉乡,东城街道,辽滨街道,西城街道,新柳街道,新城街道,大红旗镇,梁山镇,公主屯镇,兴隆镇,前当堡镇,大民屯镇,大柳屯镇,兴隆堡镇,胡台镇,法哈牛镇,柳河沟镇,高台子乡,金五台子乡,红旗乡,卢屯乡,姚堡乡,周坨子乡,于家窝堡乡,新农村乡,东蛇山子乡,陶屯乡,罗家房子乡,三道岗子乡,张屯乡,于家房镇,朱家房镇,冷子堡镇,刘二堡镇,茨榆坨镇,新民屯镇,满都户镇,杨士岗镇,肖寨门镇,长滩镇,四方台镇,城郊乡,六间房乡,养士堡乡,潘家堡乡,老观坨乡,老大房乡,大黑岗子乡,牛心坨乡,康平镇,小城子镇,张强镇,方家屯镇,东关屯镇,郝官屯镇,二牛所口镇,北四家子乡,两家子乡,山东屯乡,海洲窝堡乡,沙金台蒙古族满族乡,柳树屯蒙古族满族乡,西关屯满族蒙古族乡,东升满族蒙古族乡,法库镇,大孤家子镇,三面船镇,秀水河子镇,叶茂台镇,登士堡子镇,柏家沟镇,丁家房镇,慈恩寺乡,孟家乡,和平乡,十间房乡,冯贝堡乡,依牛堡子乡,五台子乡,四家子蒙古族乡,双台子乡,卧牛石乡,包家屯乡,香炉礁街道,站北街道,日新街道,北京街道,八一路街道,人民广场街道,白云,海军广场街道,桂林街道,人民路街道,青泥洼桥街道,昆明街道,葵英街道,桃源街道,老虎滩街道,中山公园街道,白山路街道,兴工街道,春柳街道,马栏街道,南沙河口街道,黑石礁街道,李家街道,星海湾街道,,周水子街道,椒金山街道,甘井子街道,南关岭街道,泡崖街道,中华路街道,兴华街道,机场前街道,辛寨子街道,红旗街道,凌水街道,大连湾街道,泉水街道,革镇堡镇,营城子镇,定海路街道,大桥街道,平凉路街道,江浦路街道,控江路街道,殷行街道,长白新村街道,延吉新村街道,五角场街道,四平路街道,新江湾城街道,五角场镇,龙柏街道,古美街道,莘庄镇,七宝镇,浦江镇,梅陇镇,虹桥镇,马桥镇,吴泾镇,华漕镇,颛桥镇,吴淞街道,张庙街道,友谊路街道,庙行镇,罗店镇,大场镇,顾村镇,罗泾镇,杨行镇,月浦镇,淞南镇,高境镇,嘉定镇街道,新成路街道,真新街道,马陆镇,南翔镇,江桥镇,安亭镇,外冈镇,徐行镇,华亭镇,潍坊新村街道,陆家嘴街道,塘桥街道,周家渡街道,东明路街道,洋泾街道,上钢新村街道,沪东新村街道,金杨新村街道,浦兴路街道,南码头路街道,花木街道,申港街道办事处,川沙新镇,合庆镇,曹路镇,高东镇,高桥镇,高行镇,金桥镇,张江镇,唐镇,北蔡镇,三林镇,惠南镇,新场镇,大团镇,周浦镇,航头镇,芦潮港镇,康桥镇,宣桥镇,六灶镇,祝桥镇,泥城枫泾镇,朱泾镇,亭林镇,漕泾镇,山阳镇,金山卫镇,张堰镇,廊下镇,吕巷镇岳阳街道,中山街道,永丰街道,方松街道,九亭镇,泗泾镇,泖港镇,车墩镇,洞泾镇,叶榭镇,新桥镇,石湖荡镇,新浜镇,佘山镇,小昆山镇夏阳街道,盈浦街道,香花桥街道,赵巷镇,徐泾镇,华新镇,重固镇,白鹤镇,朱家角镇,练塘镇,金泽镇,南桥镇,庄行镇,金汇镇,柘林镇,青村镇,奉城镇,四团镇,海湾镇,城桥镇,堡镇,庙镇,中兴镇,新河镇,三星镇,向化镇,绿华镇,建设镇,陈家镇,竖新镇,港西镇,港沿镇,新海镇,东平镇,新村乡,横沙乡,长兴乡".split(",");
	static {
		secondLevel.put("台湾", "台北、台中、基隆、高雄、台南、新竹、嘉义");
		secondLevel.put("江西省", "南昌、九江、赣州、吉安、鹰潭、上饶、萍乡、景德镇、新余、宜春、抚州、瑞昌市、贵溪市、瑞金市、南康市、井冈山市、丰城市、樟树市、高安市、德兴市");
		secondLevel.put("青海省", "西宁、德令哈");
		secondLevel.put("甘肃", "兰州、天水、平凉、酒泉、嘉峪关、金昌、白银、武威、张掖、庆阳、定西、陇南、敦煌市、临夏市、合作市");
		secondLevel.put("陕西省", "西安、咸阳、铜川、延安、宝鸡、渭南、汉中、安康、商洛、榆林、韩城市、华阴市");
		secondLevel.put("山西省", "太原、大同、忻州、阳泉、长治、晋城、朔州、晋中、运城、临汾、吕梁、潞城、高平、介休、永济、河津、原平、侯马、霍州、孝义、汾阳");
		secondLevel.put("湖北省",
				"武汉、襄樊、宜昌、黄石、鄂州、随州、荆州、荆门、十堰、孝感、黄冈、咸宁、丹江口市、洪湖市、石首市、松滋市、宜都市、当阳市、枝江市、老河口市、枣阳市、宜城市、钟祥市、应城市、安陆市、汉川市、麻城市、武穴市、赤壁市、广水市、仙桃市、天门市、潜江市、恩施市、利川市");
		secondLevel.put("湖南省",
				"长沙、株洲、湘潭、衡阳、岳阳、郴州、永州、邵阳、怀化、常德、益阳、张家界、娄底、醴陵市、湘乡市、韶山市、耒阳市、常宁市、武冈市、临湘市、汨罗市、津市市、沅江市、资兴市、洪江市、冷水江市、涟源市、吉首市");
		secondLevel.put("四川",
				"成都、绵阳、德阳、广元、自贡、攀枝花、乐山、南充、内江、遂宁、广安、泸州、达州、眉山、宜宾、雅安、资阳、彭州市、邛崃市、崇州市、广汉市、什邡市、绵竹市、江油市、峨眉山市、阆中市、华蓥市、万源市、简阳市、西昌市");
		secondLevel.put("贵州", "贵阳、六盘水、遵义、安顺、赤水市、仁怀市、铜仁市、毕节市、兴义市、凯里市、都匀市、福泉市");
		secondLevel.put("云南省", "昆明、曲靖、玉溪、保山、昭通、丽江、普洱、临沧、宣威市、个旧市、开远市、景洪市、楚雄市、大理市、潞西市、瑞丽市");

		secondLevel.put("海南省", "海口、三亚、文昌、万宁、五指山、儋州、东方");
		secondLevel.put("广东省",
				"广州、深圳、汕头、惠州、珠海、揭阳、佛山、河源、阳江、茂名、湛江、梅州、肇庆、韶关、潮州、东莞、中山、清远、江门、汕尾、云浮、从化市、乐昌市、南雄市、台山市、开平市、鹤山市、恩平市、廉江市、雷州市 吴川市、高州市、化州市、高要市、四会市、兴宁市、陆丰市、阳春市、英德市、连州市、普宁市、罗定市");
		secondLevel.put("福建省", "福州、厦门、泉州、三明、南平、漳州、莆田、宁德、龙岩、长乐市、永安市、石狮市、晋江市、南安市、龙海市、邵武市、武夷山、建瓯市、建阳市、漳平市、福安市、福鼎市");
		secondLevel.put("浙江省",
				"杭州、嘉兴、湖州、宁波、金华、温州、丽水、绍兴、衢州、舟山、台州、富阳市、临安市、余姚市、慈溪市、奉化市、瑞安市、乐清市、海宁市、平湖市、桐乡市、诸暨市、上虞市、嵊州市、兰溪市、义乌市、东阳市、永康市、江山市、临海市、温岭市、龙泉市");

		secondLevel.put("安徽省", "合肥、蚌埠、芜湖、淮南、亳州、阜阳、淮北、宿州、滁州、安庆、巢湖、马鞍山、宣城、黄山、池州、铜陵、天长、明光、桐城、宁国");
		secondLevel.put("江苏省",
				"南京、镇江、常州、无锡、苏州、徐州、连云港、淮安、盐城、扬州、泰州、南通、宿迁、宜兴市、邳州市、新沂市、金坛市、溧阳市、常熟市、张家港市、太仓市、昆山市、吴江市、如皋市、通州市、海门市、启东市、东台市、大丰市、高邮市、江都市、仪征市、丹阳市、扬中市、句容市、泰兴市、姜堰市、靖江市、兴化市");
		secondLevel.put("山东省",
				"济南、青岛、淄博、枣庄、东营、烟台、潍坊、济宁、泰安、威海、日照、莱芜、临沂、德州、聊城、菏泽、滨州章丘、胶南、胶州、平度、莱西、即墨、滕州、龙口、莱阳、莱州、招远、蓬莱、栖霞、海阳、青州、诸城、安丘、高密、昌邑、兖州、曲阜、邹城、乳山、文登、荣成、乐陵、临清、禹城");
		secondLevel.put("河北省",
				"石家庄、唐山、邯郸、秦皇岛、保定、张家口、承德、廊坊、沧州、衡水、邢台、藁城市、晋州市、新乐市、鹿泉市、遵化市、迁安市、武安市、南宫市、沙河市、涿州市、定州市、安国市、高碑店市、泊头市、任丘市、黄骅市、河间市、霸州市、三河市、冀州市、深州市");

		secondLevel.put("辽宁省",
				"沈阳、大连、鞍山、抚顺、本溪、丹东、锦州、营口、阜新、辽阳、盘锦、铁岭、朝阳、葫芦岛、瓦房店、普兰、庄河、海城、东港、凤城、凌海、北镇、大石桥、盖州、灯塔、调兵山、开原、凌源、北票、兴城");
		secondLevel.put("吉林省",
				"长春、吉林、四平、辽源、通化、白山、松原、白城、榆树市、德惠市、舒兰市、桦甸市、蛟河市、磐石市、公主岭市、双辽市、梅河口市、集安市、临江市、大安市、洮南市、延吉市、图们市、敦化市、龙井市、珲春市、和龙市");
		secondLevel.put("黑龙江省",
				"哈尔滨、大庆、齐齐哈尔、佳木斯、鸡西、鹤岗、双鸭山、牡丹江、伊春、七台河、黑河、绥化、双城、尚志、纳河、虎林、密山、铁力、同江、富锦、绥芬河、海林、宁安、穆林、北安、五大连池、肇东、海伦、安达");
		secondLevel.put("广西", "南宁、柳州、桂林、梧州、北海、崇左、来宾、贺州、玉林、百色、河池、钦州、防城港、贵港、凭祥、合山、北流、宜州、东兴、桂平");
		secondLevel.put("北京市", "海淀区、东城区、西城区、宣武区、丰台区、朝阳区、崇文区、大兴区、石景山区、门头沟区、房山区、通州区、顺义区、怀柔区、昌平区、平谷区、密云县、延庆县");
		secondLevel.put("天津市", "和平区、河西区、河北区、河东区、南开区、红桥区、北辰区、津南区、武清区、塘沽区、西青区、汉沽区、大港区、宝坻区、东丽区、蓟县、静海县、宁河县");
		secondLevel.put("上海市", "黄浦区、卢湾区、徐汇区、长宁区、静安区、普陀区、闸北区、杨浦区、虹口区、闵行区、宝山区、嘉定区、浦东新区、金山区、松江区、青浦区、南汇区、奉贤区、崇明县");
		secondLevel.put("重庆市",
				"渝中区、大渡口区、江北区、沙坪坝区、九龙坡区、南岸区、北碚区、万盛区、双桥区、渝北区、巴南区、万州区、涪陵区、黔江区、长寿区、江津区、永川区、南川区、綦江县、潼南县、铜梁县、大足县、荣昌县、璧山县、垫江县、武隆县、丰都县、城口县、梁平县、开县、巫溪县、巫山县、奉节县、云阳县、忠县、石柱土家族自治县、彭水苗族土家族自治县、酉阳苗族自治县、秀山土家族苗族自治县");
		secondLevel.put("新疆", "乌鲁木齐、克拉玛依、石河子、阿拉尔市、图木舒克、五家渠、哈密、吐鲁番、阿克苏、喀什、和田、伊宁、塔城、阿勒泰、奎屯、博乐、昌吉、阜康、库尔勒、阿图什、乌苏");
		secondLevel.put("西藏", "拉萨、日喀则");
		secondLevel.put("内蒙古",
				"呼和浩特、包头、乌海、赤峰、通辽、鄂尔多斯、呼伦贝尔、巴彦淖尔、乌兰察布、满洲里市、牙克石市、扎兰屯市、根河市、额尔古纳市、丰镇市、锡林浩特市、二连浩特市、乌兰浩特市、阿尔山市");

	}
	private static Random random = new Random();
	public static String generateAddress(){
		StringBuffer sb = new StringBuffer(firstLevel[random.nextInt(firstLevel.length)]);
		String[] seconds=secondLevel.get(sb.toString()).split("、");
		sb.append(" ").append(seconds[random.nextInt(seconds.length)]);
		
		int length = random.nextInt(2);
		
		for(int i=0;i<=length;i++){
			sb.append(" ").append(thridLevel[random.nextInt(thridLevel.length)]);
		}
		
		
		
		sb.append(" ").append(random.nextInt(699)).append("号");
		
		return sb.toString();
	}
	
	public static void main(String[] args) {
		System.out.println(generateAddress());
	}
	
}
